package prod;

public class ServiceProcess {
    /**
     * 서비스를 운영하며 서버를 크게 4가지로 구분 할 수 있다.
     * - 로컬 서버 : 개발자들이 개인 개발 환경에 따라 달라지는 서버, local 환경에서 실행시키는 서버이다.
     * - 개발 서버 : Development Server
     *      - 개인 개발 환경이 아닌, 1개의 통합된 환경으로 테스트를 할 수 있는 서버
     *      - Staging 서버와 환경을 비슷하게 구성하여 테스트를 하는 경우도 있다.
     * - 스테이징 서버 : Staging Server
     *      - Test Server, QA Server등으로도 불림
     *      - 운영서버 환경과 거의 100% 비슷할 정도로 환경을 맞춘 다음, 운영 서버에서 사용되는 데이터를 갖고 실질적으로 운영 서버에 반영하기 전 테스트를 거치는 서버
     * - 운영 서버 : Production Server
     *      - 실질적으로 운영을 하기 위한 서버
     *      - 스테이징 서버에서 정상적으로 작동되는 기능들을 운영 서버에 반영한다.
     */
}
