package Http;

public class Response {
    public static void main(String[] args) {
        /**
         * HTTP Response의 구조는 Status Line, Header, Body로 되어있다.
         *  - Status Line : HTTP Version, Status Code, Status Text로 나뉜다.
         *      - Status Code : 응답에 대한 간략한 숫자정보
         *          - 100번대 (조건부 응답)
         *              - 100 Continue(계속) : 클라이언틍는 요청을 지속해야한다. 서버가 이 코드를 제공하여 요청의 첫 번째 부분을 받았고, 나머지 부분을 기다린다는 의미
         *              - 101 Switching Protocol(프로토콜 전환) : 클라이언트가 서버에 프로토콜 전환을 요청하였으며, 서버가 승인중이라는 것을 의미한다.
         *
         *          - 200번대 (성공)
         *              - 200 OK(성공) : 서버가 클라이언트의 요청을 제대로 수행했다는 의미로, 주로 요청한 페이지를 제공했다는 의미로 사용
         *              - 201 Created(작성됨) : 요청이 성공적이였으며, 그 결과 새로운 리소스가 생성됐다.
         *                                   - 이 응답은 일반적으로 POST 요청 또는 일부 PUT 요청 이후에 따라온다.
         *              - 204 (콘텐츠 없음) : 서버가 요청을 성공적으로 처리했지만, 콘텐츠를 표시하지 않는다.
         *              - 205(콘텐츠 재설정) : 204 응답과 달리, 이 응답은 클라이언트가 문서 보기를 재설정 할 것을 요청한다(새 입력을 위한 양식 비우기 등,,)
         *              - 206(일부 콘텐츠) : 서버가 GET 요청의 일부만 성공적으로 처리했다는 의미
         *
         *          - 300번대 (리다이렉션)
         *              - 301 Moved Permanently(영구이동) : 요청한 페이지를 새 위치로 영구적으로 이동했다는 의미이다. GET 또는 HEAD 요청에 대한 응답으로, 이 응답을 표시하면 클라이언트가 자동으로 새 위치로 전달된다.
         *              - 303(기타 위치 보기) : 클라이언트가 다른 위치에 별도의 GET 요청을 하여 응답을 검색할 경우, 서버는 이 코드를 표시한다. HEAD 요청 이외의 모든 요청을 다른 위치로 자동 전달한다.
         *              - 304 Not Modified(수정되지 않음) : 마지막 요청 이후, 요청한 페이지가 수정되지 않았따는 것을 의미한다.
         *
         *          - 400번대(요청 오류)
         *              - 400 Bad Request(잘못된 요청) : 서버가 요청의 구문을 인식하지못하는 경우이다.
         *              - 401 Unauthorized(권한 없음) : 인증이 필요하다는 것을 의미한다.
         *                             - 서버는 로그인이 필요한 페이지에 대해 이 요청을 제공할 수 있다.
         *                             - 권한없음보다는 인증안됨과 더 가까운 의미를 가진다.
         *              - 404 Not Found(찾을 수 없음) : 서버가 요청한 페이지를 찾을 수 없다.
         *                                           - 서버에 존재하지 않는 페이지에 대한 요청이 있을 경우 해당 코드를 제공한다.
         *
         *          - 500번대 (서버 오류)
         *              - 500 (내부 서버 오류) : 서버에 오류가 발생하여 요청을 수행할 수 없다.
         *              - 501(구현되지 않음) : 서버에 요청을 수행할 수 있는 기능이 없다.
         *                                 - 예를 들어 서버가 요청 메서드를 인식하지 못할 때 이 코드를 표시한다.
         *              - 503(서비스를 사용할 수 없음) : 서버가 오버로드 되었거나 유지관리를 위해 다운되었기 때문에 현재 서버를 사용할 수 없다.
         *                                         - 503코드가 제공되는 경우는 대부분 일시적인 상태이다.
         *      - Status Text : 응답 상태를 간략하게 설명해주는 부분
         *
         *  - Header : Request의 header와 동일한 구조이지만 Response에서만 사용되는 header값들이 있음
         *      - User-Agent대신 Server헤더가 사용
         *  - Body : Reqeust의 body와 보통 동일, 모든 Response가 body를 포함하지는 않고, 클라이언트측으로 전송할 데이터가 없으면 body는 비어있을 수 있음
         */
    }
}
